# Pymoli HW

In [5]:
import pandas as pd
import json 
import numpy as np

In [6]:
data = "Homework/purchase_data2.json"

In [7]:
new_data_df = pd.read_json(data)
new_data_df.head()

   Age Gender  Item ID                 Item Name  Price          SN
0   20   Male       93  Apocalyptic Battlescythe   4.49     Iloni35
1   21   Male       12                     Dawne   3.36   Aidaira26
2   17   Male        5                Putrid Fan   2.63      Irim47
3   17   Male      123         Twilight's Carver   2.55     Irith83
4   22   Male      154              Feral Katana   4.11  Philodil43

# Player Count

In [8]:
#total number of players 
player_counts= new_data_df["SN"].value_counts()
player_counts.count()

74

In [9]:
s = pd.value_counts(new_data_df.SN)
s1 = pd.Series({'nunique': len(s), 'unique values': s.index.tolist()})
s.append(s1)
s1

nunique                                                         74
unique values    [Hairith93, Sundaky74, Aidaira26, Chaniman66, ...
dtype: object

In [10]:
players = {
    "Total players": [74]
    
}    
players_total = pd.DataFrame(players, columns=["Total players"])
players_total

   Total players
0             74

# Purchasing Analysis (Total)

#Number of Unique Items#Average Purchase Price#Total Number of Purchases#Total Revenue

In [11]:
#Total Revenue
Total_revenue= new_data_df["Price"].sum()
Total_revenue

228.0999999999999

In [12]:
#Average Purchase Price
Average_Purchase_Price= new_data_df["Price"].mean()
Average_Purchase_Price

2.9243589743589733

In [13]:
#Total Number of Purchases
Number_of_unique_item= new_data_df["Item Name"].nunique()
Number_of_unique_item

63

In [14]:
Total_Number_of_Purchases = new_data_df["Item ID"].count()
Total_Number_of_Purchases

78

In [15]:
 Analysis = {
    "Total revenue": [228.0999999999999],
    "Average Purchase Price": [2.92],
    "Number of unique item": [63],
    "Total Number of Purchases":[78],
}
    
Purchasing_Analysis = pd.DataFrame(Analysis, columns=["Number of unique item", "Average Purchase Price", "Total Number of Purchases","Total revenue"])
Purchasing_Analysis

,Number of unique item,Average Purchase Price,Total Number of Purchases,Total revenue
0,63,2.92,78,228.1

# Gender Demographics

In [16]:
#Percentage and Count of Male Players
#Percentage and Count of Female Players
#Percentage and Count of Other / Non-Disclosed

In [17]:
gender= new_data_df["Gender"].value_counts()
gender

Male                     64
Female                   13
Other / Non-Disclosed     1
Name: Gender, dtype: int64

In [18]:
gender_percent = round(new_data_df["Gender"].value_counts()/new_data_df["Gender"].count(), 2)*100
gender_percent.map("{}%".format)

Male                     82.0%
Female                   17.0%
Other / Non-Disclosed     1.0%
Name: Gender, dtype: object

In [19]:
 GAnalysis = {
    "Gender": ["Male","Female","Other/Non-Disclosed"],
    "Percent of Player": [82.0,17.0,1.1],
    "Total count": [64,13,1],
    
}
    
Gender_Analysis = pd.DataFrame(GAnalysis, columns=["Gender", "Percent of Player", "Total count"])
Gender_Analysis

                Gender  Percent of Player  Total count
0                 Male               82.0           64
1               Female               17.0           13
2  Other/Non-Disclosed                1.1            1

# Purchasing Analysis (Gender)

In [20]:
#The below each broken by gender #Purchase Count#Average Purchase Price #Total Purchase Value#Normalized Totals

In [21]:
x= new_data_df.groupby(['Gender','Item ID']).sum(axis=1)
x_new=pd.DataFrame(x)
#x_new.head()

In [22]:
gender_purchase_total = new_data_df.groupby(["Gender"]).sum()["Price"].rename("Total Purchase Value")
gender_purchase_total

Gender
Female                    41.38
Male                     184.60
Other / Non-Disclosed      2.12
Name: Total Purchase Value, dtype: float64

In [23]:
avg_purchase_total_gender = new_data_df.groupby(["Gender"]).mean()["Price"].rename("Total Purchase Value")
avg_purchase_total_gender

Gender
Female                   3.183077
Male                     2.884375
Other / Non-Disclosed    2.120000
Name: Total Purchase Value, dtype: float64

In [24]:
 #total purchase value per gender and then divide by the total count of that gender
norm_purchase_total_gender = (gender_purchase_total)/gender
norm_purchase_total_gender

Female                   3.183077
Male                     2.884375
Other / Non-Disclosed    2.120000
dtype: float64

In [25]:
gender_purchase_count = new_data_df.groupby(["Gender"]).count()["Item ID"].rename("Purchase count")
gender_purchase_count

Gender
Female                   13
Male                     64
Other / Non-Disclosed     1
Name: Purchase count, dtype: int64

In [26]:
gender_data = pd.DataFrame({"Purchase Count": gender_purchase_count, "Avg purchase price": avg_purchase_total_gender, "total purchase": gender_purchase_total, "norm total gender": norm_purchase_total_gender})
gender_data

,Avg purchase price,Purchase Count,norm total gender,total purchase
Gender,,,,
Female,3.183077,13,3.183077,41.38
Male,2.884375,64,2.884375,184.60
Other / Non-Disclosed,2.120000,1,2.120000,2.12

In [27]:
gender_data["total purchase"]=gender_data["total purchase"].map(lambda x: "$"+str(x))
gender_data

,Avg purchase price,Purchase Count,norm total gender,total purchase
Gender,,,,
Female,3.183077,13,3.183077,$41.38
Male,2.884375,64,2.884375,$184.6
Other / Non-Disclosed,2.120000,1,2.120000,$2.12

# Age Demographics

In [28]:
raw_data= {
    "Gender": ["Female","Male","Other/Non-Disclosed"],
    "Purchase Count" : [13,64,1], 
    "Avg purchase price" : [3.18,2.88,2.12],
    "Total purchase" : [41.38,184.60, 2.12], 
    "Normalized total": [3.18,2.88,2.12]}
df = pd.DataFrame(raw_data)
df

,Avg purchase price,Gender,Normalized total,Purchase Count,Total purchase
0,3.18,Female,3.18,13,41.38
1,2.88,Male,2.88,64,184.60
2,2.12,Other/Non-Disclosed,2.12,1,2.12

In [29]:
# Create the bins in which Data will be held
# Bins are 10, 10-14, 15-19,20-24,25-29,30-34,35-39,40+

bins = [0,10, 14, 19,24,29,34,39,40]
# Create the names for the four bins
group_labels = ["<10", "10-14", "15-19","20-24","25-29","30-34","35-39","40+"]
# Cut postTestScore and place the scores into bins
pd.cut(new_data_df["Age"],bins,labels=group_labels).head()

0    20-24
1    20-24
2    15-19
3    15-19
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [30]:
new_data_df["Age Group"] = pd.cut(new_data_df["Age"],bins,labels=group_labels)
#new_data_df.head(3)

In [31]:
Total_purchase_value = new_data_df.groupby(["Age Group"]).sum()["Price"].rename("Total Purchase")
Total_purchase_value

Age Group
<10       13.82
10-14      8.96
15-19     30.41
20-24    108.89
25-29     26.11
30-34     13.89
35-39     21.37
40+        4.65
Name: Total Purchase, dtype: float64

In [32]:
Total_purchase_count = new_data_df.groupby(["Age Group"]).count()["Gender"].rename("Total Purchase")
Total_purchase_count

Age Group
<10       5
10-14     3
15-19    11
20-24    36
25-29     9
30-34     7
35-39     6
40+       1
Name: Total Purchase, dtype: int64

In [33]:
avg_purchase_total = new_data_df.groupby(["Age Group"]).mean()["Price"].rename("Total Purchase")
avg_purchase_total

Age Group
<10      2.764000
10-14    2.986667
15-19    2.764545
20-24    3.024722
25-29    2.901111
30-34    1.984286
35-39    3.561667
40+      4.650000
Name: Total Purchase, dtype: float64

In [34]:
normalised_total_value =Total_purchase_value/Total_purchase_count
normalised_total_value

Age Group
<10      2.764000
10-14    2.986667
15-19    2.764545
20-24    3.024722
25-29    2.901111
30-34    1.984286
35-39    3.561667
40+      4.650000
Name: Total Purchase, dtype: float64

In [35]:
Age_data = pd.DataFrame({"Purchase Count": Total_purchase_count, "Avg purchase price": avg_purchase_total, "total purchase": Total_purchase_value, "norm total gender":normalised_total_value})
Age_data

,Avg purchase price,Purchase Count,norm total gender,total purchase
Age Group,,,,
<10,2.764000,5,2.764000,13.82
10-14,2.986667,3,2.986667,8.96
15-19,2.764545,11,2.764545,30.41
20-24,3.024722,36,3.024722,108.89
25-29,2.901111,9,2.901111,26.11
30-34,1.984286,7,1.984286,13.89
35-39,3.561667,6,3.561667,21.37
40+,4.650000,1,4.650000,4.65


# Top Spenders calculation

In [36]:
#Identify the 5 most popular items by purchase count, then list (in a table):Item ID,Item Name, 
#Purchase Count,Item Price,Total Purchase Value
SN_count_purchse = new_data_df.groupby(["SN"]).count()["Price"].rename("Total Purchase")
SN_count_purchse.head()

SN
Aeri79           1
Aerithllora36    1
Aesririam61      1
Aesurstilis64    1
Aidaira26        2
Name: Total Purchase, dtype: int64

In [37]:
SN_avg_purchse = new_data_df.groupby(["SN"]).mean()["Price"].rename("Total Purchase")
SN_avg_purchse.head()

SN
Aeri79           4.150
Aerithllora36    4.650
Aesririam61      2.650
Aesurstilis64    4.250
Aidaira26        2.565
Name: Total Purchase, dtype: float64

In [38]:
SN_total_purchse = new_data_df.groupby(["SN"]).sum()["Price"].rename("Total Purchase")
SN_total_purchse.head()

SN
Aeri79           4.15
Aerithllora36    4.65
Aesririam61      2.65
Aesurstilis64    4.25
Aidaira26        5.13
Name: Total Purchase, dtype: float64

In [39]:
spender_data = pd.DataFrame({"Purchase Count": SN_count_purchse, "Avg purchase price": SN_avg_purchse, "total purchase": SN_total_purchse, })

# Top Spenders

In [40]:
spender_data.sort_values("total purchase",ascending=False,inplace=True)
spender_data.head(5)

            Avg purchase price  Purchase Count  total purchase
SN
Sundaky74                3.705               2            7.41
Aidaira26                2.565               2            5.13
Eusty71                  4.810               1            4.81
Chanirra64               4.780               1            4.78
Alarap40                 4.710               1            4.71

# Most Popular Items

In [41]:
spender_data.sort_values(["Purchase Count"],ascending=False,inplace=True)
spender_data.head(5)

            Avg purchase price  Purchase Count  total purchase
SN
Sundaky74                3.705               2            7.41
Hairith93                2.125               2            4.25
Chaniman66               1.615               2            3.23
Aidaira26                2.565               2            5.13
Undadar97                1.290               1            1.29


# Most Profitable Items

In [42]:
spender_data.sort_values("total purchase",ascending=False,inplace=True)
spender_data.head(5)

            Avg purchase price  Purchase Count  total purchase
SN
Sundaky74                3.705               2            7.41
Aidaira26                2.565               2            5.13
Eusty71                  4.810               1            4.81
Chanirra64               4.780               1            4.78
Alarap40                 4.710               1            4.71